Revit 2027 API
FailureDefinitionAccessor.IsResolutionApplicable Method
 Checks if the given resolution type is applicable to the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsResolutionApplicable(
	FailureResolutionType type
)
Public Function IsResolutionApplicable (
	type As FailureResolutionType
) As Boolean
public:
bool IsResolutionApplicable(
	FailureResolutionType type
)
member IsResolutionApplicable :
        type : FailureResolutionType -> bool
Parameters
type FailureResolutionType
 The resolution type to check.
Return Value
Boolean
 True if the given resolution type is applicable to the failure, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized.
See Also
Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace